fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСозданныхРеализацийУслуг</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРеализацию</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	
	ДлительнаяОперация = СоздатьРеализациюНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗавершения", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры


&НаКлиенте
Процедура ПечатьАктов(Команда)
	
	Если Объект.СписокСозданныхРеализацийУслуг.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет созданных реализаций для печати!");
		Возврат;
	КонецЕсли;
	
	ПечатьАктовНаКлиенте();
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОповещениеЗавершения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатНаСервере(Результат.АдресРезультата);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка при выполнении операции: " + Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(АдресРезультата)
	
	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Очистить();
		Для Каждого СтрокаРезультат Из ТаблицаРезультата Цикл
			НоваяСтрока = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Добавить();
			НоваяСтрока.Договор = СтрокаРезультат.Договор;
			НоваяСтрока.СсылкаНаРеализацию = СтрокаРезультат.СсылкаНаРеализацию;
		КонецЦикла;
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создано %1 реализаций услуг", ТаблицаРезультата.Количество()));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСписокДоговоров(Объект.Период);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктовНаКлиенте()
	
	МассивДокументов = МассивСсылокДляПечати();
	Если МассивДокументов.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг", 
							"АктОбОказанныхУслугах" ,
							МассивДокументов,
							ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СоздатьРеализациюНаСервере()
	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДоговоров = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Выгрузить();
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьИлиОбновитьРеализации", ОбработкаОбъект.Период, ТаблицаДоговоров);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Функция МассивСсылокДляПечати()
	
	МассивДокументов = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДоговоров = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Выгрузить();
	Для Каждого Строка Из ТаблицаДоговоров Цикл
		Если ЗначениеЗаполнено(Строка.СсылкаНаРеализацию) Тогда
			МассивДокументов.Добавить(Строка.СсылкаНаРеализацию);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;

КонецФункции

#КонецОбласти
